In [1]:
# Add the Pandas dependency.
import pandas as pd

In [2]:
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

# Create a Pandas Series from a list
school_series = pd.Series(high_schools)

In [3]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [4]:
#convert high school dictionary data frame
school1_df = pd.DataFrame(high_school_dicts)

In [5]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [6]:
# Initialize a new DataFrame.
school2_df = pd.DataFrame()

# Add the list to a new DataFrame.
school2_df["School ID"] = school_id
school2_df["School Name"] = school_name
school2_df["School Type"] = type_of_school

# Print the DataFrame.
#school2_df

In [7]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

school3_df = pd.DataFrame(high_schools_dict)
#school3_df

In [8]:
#school_df.columns
#school_df.index
#school_df.values

In [11]:
#open data file and creat new df
grades_missing_df=pd.read_csv("Resources/missing_grades.csv")
grades_missing_df.head(10)

   Student ID       student_name gender grade  reading_score  math_score
0           0       Paul Bradley      M   9th           66.0        79.0
1           1       Victor Smith      M  12th           94.0        61.0
2           2    Kevin Rodriguez      M  12th            NaN        60.0
3           3  Dr. Richard Scott      M  12th           67.0        58.0
4           4         Bonnie Ray      F   9th           97.0        84.0
5           5      Bryan Miranda      M   9th           94.0         NaN
6           6      Sheena Carter      F  11th           82.0        80.0
7           7       Nicole Baker      F  12th           96.0        69.0

In [12]:
#find number os missing data
grades_missing_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
reading_score    1
math_score       1
dtype: int64

In [13]:
#fill data with average of each column
grades_missing_df.fillna(grades_missing_df.mean())

   Student ID       student_name gender grade  reading_score  math_score
0           0       Paul Bradley      M   9th      66.000000   79.000000
1           1       Victor Smith      M  12th      94.000000   61.000000
2           2    Kevin Rodriguez      M  12th      85.142857   60.000000
3           3  Dr. Richard Scott      M  12th      67.000000   58.000000
4           4         Bonnie Ray      F   9th      97.000000   84.000000
5           5      Bryan Miranda      M   9th      94.000000   70.142857
6           6      Sheena Carter      F  11th      82.000000   80.000000
7           7       Nicole Baker      F  12th      96.000000   69.000000